apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_interrupt_core1.h
/* INTERRUPT_CORE1_RWBLE_IRQ_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map rwble_irq interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_RWBLE_IRQ_MAP    0x0000001f
#define INTERRUPT_CORE1_RWBLE_IRQ_MAP_M  (INTERRUPT_CORE1_RWBLE_IRQ_MAP_V << INTERRUPT_CORE1_RWBLE_IRQ_MAP_S)
#define INTERRUPT_CORE1_RWBLE_IRQ_MAP_V  0x0000001f
#define INTERRUPT_CORE1_RWBLE_IRQ_MAP_S  0

/* INTERRUPT_CORE1_RWBT_NMI_MAP_REG register
 * rwbt_nmi interrupt configuration register
 */

#define INTERRUPT_CORE1_RWBT_NMI_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x24)

/* INTERRUPT_CORE1_RWBT_NMI_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map rwbt_nmi interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_RWBT_NMI_MAP    0x0000001f
#define INTERRUPT_CORE1_RWBT_NMI_MAP_M  (INTERRUPT_CORE1_RWBT_NMI_MAP_V << INTERRUPT_CORE1_RWBT_NMI_MAP_S)
#define INTERRUPT_CORE1_RWBT_NMI_MAP_V  0x0000001f
#define INTERRUPT_CORE1_RWBT_NMI_MAP_S  0

/* INTERRUPT_CORE1_RWBLE_NMI_MAP_REG register
 * rwble_nmi interrupt configuration register
 */

#define INTERRUPT_CORE1_RWBLE_NMI_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x28)

/* INTERRUPT_CORE1_RWBLE_NMI_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map rwble_nmi interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_RWBLE_NMI_MAP    0x0000001f
#define INTERRUPT_CORE1_RWBLE_NMI_MAP_M  (INTERRUPT_CORE1_RWBLE_NMI_MAP_V << INTERRUPT_CORE1_RWBLE_NMI_MAP_S)
#define INTERRUPT_CORE1_RWBLE_NMI_MAP_V  0x0000001f
#define INTERRUPT_CORE1_RWBLE_NMI_MAP_S  0

/* INTERRUPT_CORE1_I2C_MST_INT_MAP_REG register
 * i2c_mst interrupt configuration register
 */

#define INTERRUPT_CORE1_I2C_MST_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x2c)

/* INTERRUPT_CORE1_I2C_MST_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map i2c_mst interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_I2C_MST_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_I2C_MST_INT_MAP_M  (INTERRUPT_CORE1_I2C_MST_INT_MAP_V << INTERRUPT_CORE1_I2C_MST_INT_MAP_S)
#define INTERRUPT_CORE1_I2C_MST_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_I2C_MST_INT_MAP_S  0

/* INTERRUPT_CORE1_SLC0_INTR_MAP_REG register
 * slc0 interrupt configuration register
 */

#define INTERRUPT_CORE1_SLC0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x30)

/* INTERRUPT_CORE1_SLC0_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map slc0 interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_SLC0_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_SLC0_INTR_MAP_M  (INTERRUPT_CORE1_SLC0_INTR_MAP_V << INTERRUPT_CORE1_SLC0_INTR_MAP_S)
#define INTERRUPT_CORE1_SLC0_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_SLC0_INTR_MAP_S  0

/* INTERRUPT_CORE1_SLC1_INTR_MAP_REG register
 * slc1 interrupt configuration register
 */

#define INTERRUPT_CORE1_SLC1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x34)

/* INTERRUPT_CORE1_SLC1_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map slc1 interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_SLC1_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_SLC1_INTR_MAP_M  (INTERRUPT_CORE1_SLC1_INTR_MAP_V << INTERRUPT_CORE1_SLC1_INTR_MAP_S)
#define INTERRUPT_CORE1_SLC1_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_SLC1_INTR_MAP_S  0

/* INTERRUPT_CORE1_UHCI0_INTR_MAP_REG register
 * uhci0 interrupt configuration register
 */

#define INTERRUPT_CORE1_UHCI0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x38)

/* INTERRUPT_CORE1_UHCI0_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map uhci0 interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_UHCI0_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_UHCI0_INTR_MAP_M  (INTERRUPT_CORE1_UHCI0_INTR_MAP_V << INTERRUPT_CORE1_UHCI0_INTR_MAP_S)
#define INTERRUPT_CORE1_UHCI0_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_UHCI0_INTR_MAP_S  0

/* INTERRUPT_CORE1_UHCI1_INTR_MAP_REG register
 * uhci1 interrupt configuration register
 */

#define INTERRUPT_CORE1_UHCI1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x3c)

/* INTERRUPT_CORE1_UHCI1_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map uhci1 interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_UHCI1_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_UHCI1_INTR_MAP_M  (INTERRUPT_CORE1_UHCI1_INTR_MAP_V << INTERRUPT_CORE1_UHCI1_INTR_MAP_S)
#define INTERRUPT_CORE1_UHCI1_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_UHCI1_INTR_MAP_S  0

/* INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_MAP_REG register
 * gpio_interrupt_pro interrupt configuration register
 */

#define INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x40)

/* INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map gpio_interrupt_pro interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_MAP    0x0000001f
#define INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_MAP_M  (INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_MAP_V << INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_MAP_S)
#define INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_MAP_V  0x0000001f
#define INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_MAP_S  0

/* INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_NMI_MAP_REG register
 * gpio_interrupt_pro_nmi interrupt configuration register
 */

#define INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_NMI_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x44)

/* INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_NMI_MAP : R/W; bitpos: [4:0]; default:
 * 16;
 * this register used to map gpio_interrupt_pro_nmi interrupt to one of
 * core1's external interrupt
 */

#define INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_NMI_MAP    0x0000001f
#define INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_NMI_MAP_M  (INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_NMI_MAP_V << INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_NMI_MAP_S)
#define INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_NMI_MAP_V  0x0000001f
#define INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_NMI_MAP_S  0

/* INTERRUPT_CORE1_GPIO_INTERRUPT_APP_MAP_REG register
 * gpio_interrupt_app interrupt configuration register
 */

