apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_interrupt_core1.h
/* INTERRUPT_CORE1_UART2_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map uart2 interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_UART2_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_UART2_INTR_MAP_M  (INTERRUPT_CORE1_UART2_INTR_MAP_V << INTERRUPT_CORE1_UART2_INTR_MAP_S)
#define INTERRUPT_CORE1_UART2_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_UART2_INTR_MAP_S  0

/* INTERRUPT_CORE1_SDIO_HOST_INTERRUPT_MAP_REG register
 * sdio_host interrupt configuration register
 */

#define INTERRUPT_CORE1_SDIO_HOST_INTERRUPT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x78)

/* INTERRUPT_CORE1_SDIO_HOST_INTERRUPT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map sdio_host interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_SDIO_HOST_INTERRUPT_MAP    0x0000001f
#define INTERRUPT_CORE1_SDIO_HOST_INTERRUPT_MAP_M  (INTERRUPT_CORE1_SDIO_HOST_INTERRUPT_MAP_V << INTERRUPT_CORE1_SDIO_HOST_INTERRUPT_MAP_S)
#define INTERRUPT_CORE1_SDIO_HOST_INTERRUPT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_SDIO_HOST_INTERRUPT_MAP_S  0

/* INTERRUPT_CORE1_PWM0_INTR_MAP_REG register
 * pwm0 interrupt configuration register
 */

#define INTERRUPT_CORE1_PWM0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x7c)

/* INTERRUPT_CORE1_PWM0_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map pwm0 interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_PWM0_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_PWM0_INTR_MAP_M  (INTERRUPT_CORE1_PWM0_INTR_MAP_V << INTERRUPT_CORE1_PWM0_INTR_MAP_S)
#define INTERRUPT_CORE1_PWM0_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_PWM0_INTR_MAP_S  0

/* INTERRUPT_CORE1_PWM1_INTR_MAP_REG register
 * pwm1 interrupt configuration register
 */

#define INTERRUPT_CORE1_PWM1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x80)

/* INTERRUPT_CORE1_PWM1_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map pwm1 interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_PWM1_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_PWM1_INTR_MAP_M  (INTERRUPT_CORE1_PWM1_INTR_MAP_V << INTERRUPT_CORE1_PWM1_INTR_MAP_S)
#define INTERRUPT_CORE1_PWM1_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_PWM1_INTR_MAP_S  0

/* INTERRUPT_CORE1_PWM2_INTR_MAP_REG register
 * pwm2 interrupt configuration register
 */

#define INTERRUPT_CORE1_PWM2_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x84)

/* INTERRUPT_CORE1_PWM2_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map pwm2 interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_PWM2_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_PWM2_INTR_MAP_M  (INTERRUPT_CORE1_PWM2_INTR_MAP_V << INTERRUPT_CORE1_PWM2_INTR_MAP_S)
#define INTERRUPT_CORE1_PWM2_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_PWM2_INTR_MAP_S  0

/* INTERRUPT_CORE1_PWM3_INTR_MAP_REG register
 * pwm3 interrupt configuration register
 */

#define INTERRUPT_CORE1_PWM3_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x88)

/* INTERRUPT_CORE1_PWM3_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map pwm3 interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_PWM3_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_PWM3_INTR_MAP_M  (INTERRUPT_CORE1_PWM3_INTR_MAP_V << INTERRUPT_CORE1_PWM3_INTR_MAP_S)
#define INTERRUPT_CORE1_PWM3_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_PWM3_INTR_MAP_S  0

/* INTERRUPT_CORE1_LEDC_INT_MAP_REG register
 * ledc interrupt configuration register
 */

#define INTERRUPT_CORE1_LEDC_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x8c)

/* INTERRUPT_CORE1_LEDC_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map ledc interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_LEDC_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_LEDC_INT_MAP_M  (INTERRUPT_CORE1_LEDC_INT_MAP_V << INTERRUPT_CORE1_LEDC_INT_MAP_S)
#define INTERRUPT_CORE1_LEDC_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_LEDC_INT_MAP_S  0

/* INTERRUPT_CORE1_EFUSE_INT_MAP_REG register
 * efuse interrupt configuration register
 */

#define INTERRUPT_CORE1_EFUSE_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x90)

/* INTERRUPT_CORE1_EFUSE_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map efuse interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_EFUSE_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_EFUSE_INT_MAP_M  (INTERRUPT_CORE1_EFUSE_INT_MAP_V << INTERRUPT_CORE1_EFUSE_INT_MAP_S)
#define INTERRUPT_CORE1_EFUSE_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_EFUSE_INT_MAP_S  0

/* INTERRUPT_CORE1_CAN_INT_MAP_REG register
 * can interrupt configuration register
 */

#define INTERRUPT_CORE1_CAN_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x94)

/* INTERRUPT_CORE1_CAN_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map can interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_CAN_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_CAN_INT_MAP_M  (INTERRUPT_CORE1_CAN_INT_MAP_V << INTERRUPT_CORE1_CAN_INT_MAP_S)
#define INTERRUPT_CORE1_CAN_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_CAN_INT_MAP_S  0

/* INTERRUPT_CORE1_USB_INTR_MAP_REG register
 * usb interrupt configuration register
 */

#define INTERRUPT_CORE1_USB_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x98)

/* INTERRUPT_CORE1_USB_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map usb interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_USB_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_USB_INTR_MAP_M  (INTERRUPT_CORE1_USB_INTR_MAP_V << INTERRUPT_CORE1_USB_INTR_MAP_S)
#define INTERRUPT_CORE1_USB_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_USB_INTR_MAP_S  0

/* INTERRUPT_CORE1_RTC_CORE_INTR_MAP_REG register
 * rtc_core interrupt configuration register
 */

#define INTERRUPT_CORE1_RTC_CORE_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x9c)

/* INTERRUPT_CORE1_RTC_CORE_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map rtc_core interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_RTC_CORE_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_RTC_CORE_INTR_MAP_M  (INTERRUPT_CORE1_RTC_CORE_INTR_MAP_V << INTERRUPT_CORE1_RTC_CORE_INTR_MAP_S)
#define INTERRUPT_CORE1_RTC_CORE_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_RTC_CORE_INTR_MAP_S  0

/* INTERRUPT_CORE1_RMT_INTR_MAP_REG register
 * rmt interrupt configuration register
 */

#define INTERRUPT_CORE1_RMT_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xa0)

