apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_interrupt_core1.h
/* INTERRUPT_CORE1_RMT_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map rmt interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_RMT_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_RMT_INTR_MAP_M  (INTERRUPT_CORE1_RMT_INTR_MAP_V << INTERRUPT_CORE1_RMT_INTR_MAP_S)
#define INTERRUPT_CORE1_RMT_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_RMT_INTR_MAP_S  0

/* INTERRUPT_CORE1_PCNT_INTR_MAP_REG register
 * pcnt interrupt configuration register
 */

#define INTERRUPT_CORE1_PCNT_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xa4)

/* INTERRUPT_CORE1_PCNT_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map pcnt interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_PCNT_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_PCNT_INTR_MAP_M  (INTERRUPT_CORE1_PCNT_INTR_MAP_V << INTERRUPT_CORE1_PCNT_INTR_MAP_S)
#define INTERRUPT_CORE1_PCNT_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_PCNT_INTR_MAP_S  0

/* INTERRUPT_CORE1_I2C_EXT0_INTR_MAP_REG register
 * i2c_ext0 interrupt configuration register
 */

#define INTERRUPT_CORE1_I2C_EXT0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xa8)

/* INTERRUPT_CORE1_I2C_EXT0_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map i2c_ext0 interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_I2C_EXT0_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_I2C_EXT0_INTR_MAP_M  (INTERRUPT_CORE1_I2C_EXT0_INTR_MAP_V << INTERRUPT_CORE1_I2C_EXT0_INTR_MAP_S)
#define INTERRUPT_CORE1_I2C_EXT0_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_I2C_EXT0_INTR_MAP_S  0

/* INTERRUPT_CORE1_I2C_EXT1_INTR_MAP_REG register
 * i2c_ext1 interrupt configuration register
 */

#define INTERRUPT_CORE1_I2C_EXT1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xac)

/* INTERRUPT_CORE1_I2C_EXT1_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map i2c_ext1 interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_I2C_EXT1_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_I2C_EXT1_INTR_MAP_M  (INTERRUPT_CORE1_I2C_EXT1_INTR_MAP_V << INTERRUPT_CORE1_I2C_EXT1_INTR_MAP_S)
#define INTERRUPT_CORE1_I2C_EXT1_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_I2C_EXT1_INTR_MAP_S  0

/* INTERRUPT_CORE1_SPI2_DMA_INT_MAP_REG register
 * spi2_dma interrupt configuration register
 */

#define INTERRUPT_CORE1_SPI2_DMA_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xb0)

/* INTERRUPT_CORE1_SPI2_DMA_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map spi2_dma interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_SPI2_DMA_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_SPI2_DMA_INT_MAP_M  (INTERRUPT_CORE1_SPI2_DMA_INT_MAP_V << INTERRUPT_CORE1_SPI2_DMA_INT_MAP_S)
#define INTERRUPT_CORE1_SPI2_DMA_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_SPI2_DMA_INT_MAP_S  0

/* INTERRUPT_CORE1_SPI3_DMA_INT_MAP_REG register
 * spi3_dma interrupt configuration register
 */

#define INTERRUPT_CORE1_SPI3_DMA_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xb4)

/* INTERRUPT_CORE1_SPI3_DMA_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map spi3_dma interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_SPI3_DMA_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_SPI3_DMA_INT_MAP_M  (INTERRUPT_CORE1_SPI3_DMA_INT_MAP_V << INTERRUPT_CORE1_SPI3_DMA_INT_MAP_S)
#define INTERRUPT_CORE1_SPI3_DMA_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_SPI3_DMA_INT_MAP_S  0

/* INTERRUPT_CORE1_SPI4_DMA_INT_MAP_REG register
 * spi4_dma interrupt configuration register
 */

#define INTERRUPT_CORE1_SPI4_DMA_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xb8)

/* INTERRUPT_CORE1_SPI4_DMA_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map spi4_dma interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_SPI4_DMA_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_SPI4_DMA_INT_MAP_M  (INTERRUPT_CORE1_SPI4_DMA_INT_MAP_V << INTERRUPT_CORE1_SPI4_DMA_INT_MAP_S)
#define INTERRUPT_CORE1_SPI4_DMA_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_SPI4_DMA_INT_MAP_S  0

/* INTERRUPT_CORE1_WDG_INT_MAP_REG register
 * wdg interrupt configuration register
 */

#define INTERRUPT_CORE1_WDG_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xbc)

/* INTERRUPT_CORE1_WDG_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map wdg interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_WDG_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_WDG_INT_MAP_M  (INTERRUPT_CORE1_WDG_INT_MAP_V << INTERRUPT_CORE1_WDG_INT_MAP_S)
#define INTERRUPT_CORE1_WDG_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_WDG_INT_MAP_S  0

/* INTERRUPT_CORE1_TIMER_INT1_MAP_REG register
 * timer_int1 interrupt configuration register
 */

#define INTERRUPT_CORE1_TIMER_INT1_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xc0)

/* INTERRUPT_CORE1_TIMER_INT1_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map timer_int1 interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_TIMER_INT1_MAP    0x0000001f
#define INTERRUPT_CORE1_TIMER_INT1_MAP_M  (INTERRUPT_CORE1_TIMER_INT1_MAP_V << INTERRUPT_CORE1_TIMER_INT1_MAP_S)
#define INTERRUPT_CORE1_TIMER_INT1_MAP_V  0x0000001f
#define INTERRUPT_CORE1_TIMER_INT1_MAP_S  0

/* INTERRUPT_CORE1_TIMER_INT2_MAP_REG register
 * timer_int2 interrupt configuration register
 */

#define INTERRUPT_CORE1_TIMER_INT2_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xc4)

/* INTERRUPT_CORE1_TIMER_INT2_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map timer_int2 interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_TIMER_INT2_MAP    0x0000001f
#define INTERRUPT_CORE1_TIMER_INT2_MAP_M  (INTERRUPT_CORE1_TIMER_INT2_MAP_V << INTERRUPT_CORE1_TIMER_INT2_MAP_S)
#define INTERRUPT_CORE1_TIMER_INT2_MAP_V  0x0000001f
#define INTERRUPT_CORE1_TIMER_INT2_MAP_S  0

/* INTERRUPT_CORE1_TG_T0_INT_MAP_REG register
 * tg_t0 interrupt configuration register
 */

#define INTERRUPT_CORE1_TG_T0_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xc8)

/* INTERRUPT_CORE1_TG_T0_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map tg_t0 interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_TG_T0_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_TG_T0_INT_MAP_M  (INTERRUPT_CORE1_TG_T0_INT_MAP_V << INTERRUPT_CORE1_TG_T0_INT_MAP_S)
#define INTERRUPT_CORE1_TG_T0_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_TG_T0_INT_MAP_S  0

