apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_interrupt_core1.h
/* INTERRUPT_CORE1_TG_T1_INT_MAP_REG register
 * tg_t1 interrupt configuration register
 */

#define INTERRUPT_CORE1_TG_T1_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xcc)

/* INTERRUPT_CORE1_TG_T1_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map tg_t1 interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_TG_T1_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_TG_T1_INT_MAP_M  (INTERRUPT_CORE1_TG_T1_INT_MAP_V << INTERRUPT_CORE1_TG_T1_INT_MAP_S)
#define INTERRUPT_CORE1_TG_T1_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_TG_T1_INT_MAP_S  0

/* INTERRUPT_CORE1_TG_WDT_INT_MAP_REG register
 * tg_wdt interrupt configuration register
 */

#define INTERRUPT_CORE1_TG_WDT_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xd0)

/* INTERRUPT_CORE1_TG_WDT_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map rg_wdt interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_TG_WDT_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_TG_WDT_INT_MAP_M  (INTERRUPT_CORE1_TG_WDT_INT_MAP_V << INTERRUPT_CORE1_TG_WDT_INT_MAP_S)
#define INTERRUPT_CORE1_TG_WDT_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_TG_WDT_INT_MAP_S  0

/* INTERRUPT_CORE1_TG1_T0_INT_MAP_REG register
 * tg1_t0 interrupt configuration register
 */

#define INTERRUPT_CORE1_TG1_T0_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xd4)

/* INTERRUPT_CORE1_TG1_T0_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map tg1_t0 interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_TG1_T0_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_TG1_T0_INT_MAP_M  (INTERRUPT_CORE1_TG1_T0_INT_MAP_V << INTERRUPT_CORE1_TG1_T0_INT_MAP_S)
#define INTERRUPT_CORE1_TG1_T0_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_TG1_T0_INT_MAP_S  0

/* INTERRUPT_CORE1_TG1_T1_INT_MAP_REG register
 * tg1_t1 interrupt configuration register
 */

#define INTERRUPT_CORE1_TG1_T1_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xd8)

/* INTERRUPT_CORE1_TG1_T1_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map tg1_t1 interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_TG1_T1_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_TG1_T1_INT_MAP_M  (INTERRUPT_CORE1_TG1_T1_INT_MAP_V << INTERRUPT_CORE1_TG1_T1_INT_MAP_S)
#define INTERRUPT_CORE1_TG1_T1_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_TG1_T1_INT_MAP_S  0

/* INTERRUPT_CORE1_TG1_WDT_INT_MAP_REG register
 * tg1_wdt interrupt configuration register
 */

#define INTERRUPT_CORE1_TG1_WDT_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xdc)

/* INTERRUPT_CORE1_TG1_WDT_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map tg1_wdt interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_TG1_WDT_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_TG1_WDT_INT_MAP_M  (INTERRUPT_CORE1_TG1_WDT_INT_MAP_V << INTERRUPT_CORE1_TG1_WDT_INT_MAP_S)
#define INTERRUPT_CORE1_TG1_WDT_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_TG1_WDT_INT_MAP_S  0

/* INTERRUPT_CORE1_CACHE_IA_INT_MAP_REG register
 * cache_ia interrupt configuration register
 */

#define INTERRUPT_CORE1_CACHE_IA_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xe0)

/* INTERRUPT_CORE1_CACHE_IA_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map cache_ia interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_CACHE_IA_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_CACHE_IA_INT_MAP_M  (INTERRUPT_CORE1_CACHE_IA_INT_MAP_V << INTERRUPT_CORE1_CACHE_IA_INT_MAP_S)
#define INTERRUPT_CORE1_CACHE_IA_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_CACHE_IA_INT_MAP_S  0

/* INTERRUPT_CORE1_SYSTIMER_TARGET0_INT_MAP_REG register
 * systimer_target0 interrupt configuration register
 */

#define INTERRUPT_CORE1_SYSTIMER_TARGET0_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xe4)

/* INTERRUPT_CORE1_SYSTIMER_TARGET0_INT_MAP : R/W; bitpos: [4:0]; default:
 * 16;
 * this register used to map systimer_target0 interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_SYSTIMER_TARGET0_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_SYSTIMER_TARGET0_INT_MAP_M  (INTERRUPT_CORE1_SYSTIMER_TARGET0_INT_MAP_V << INTERRUPT_CORE1_SYSTIMER_TARGET0_INT_MAP_S)
#define INTERRUPT_CORE1_SYSTIMER_TARGET0_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_SYSTIMER_TARGET0_INT_MAP_S  0

/* INTERRUPT_CORE1_SYSTIMER_TARGET1_INT_MAP_REG register
 * systimer_target1 interrupt configuration register
 */

#define INTERRUPT_CORE1_SYSTIMER_TARGET1_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xe8)

/* INTERRUPT_CORE1_SYSTIMER_TARGET1_INT_MAP : R/W; bitpos: [4:0]; default:
 * 16;
 * this register used to map systimer_target1 interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_SYSTIMER_TARGET1_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_SYSTIMER_TARGET1_INT_MAP_M  (INTERRUPT_CORE1_SYSTIMER_TARGET1_INT_MAP_V << INTERRUPT_CORE1_SYSTIMER_TARGET1_INT_MAP_S)
#define INTERRUPT_CORE1_SYSTIMER_TARGET1_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_SYSTIMER_TARGET1_INT_MAP_S  0

/* INTERRUPT_CORE1_SYSTIMER_TARGET2_INT_MAP_REG register
 * systimer_target2 interrupt configuration register
 */

#define INTERRUPT_CORE1_SYSTIMER_TARGET2_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xec)

/* INTERRUPT_CORE1_SYSTIMER_TARGET2_INT_MAP : R/W; bitpos: [4:0]; default:
 * 16;
 * this register used to map systimer_target2 interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_SYSTIMER_TARGET2_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_SYSTIMER_TARGET2_INT_MAP_M  (INTERRUPT_CORE1_SYSTIMER_TARGET2_INT_MAP_V << INTERRUPT_CORE1_SYSTIMER_TARGET2_INT_MAP_S)
#define INTERRUPT_CORE1_SYSTIMER_TARGET2_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_SYSTIMER_TARGET2_INT_MAP_S  0

/* INTERRUPT_CORE1_SPI_MEM_REJECT_INTR_MAP_REG register
 * spi_mem_reject interrupt configuration register
 */

#define INTERRUPT_CORE1_SPI_MEM_REJECT_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xf0)

/* INTERRUPT_CORE1_SPI_MEM_REJECT_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map spi_mem_reject interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_SPI_MEM_REJECT_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_SPI_MEM_REJECT_INTR_MAP_M  (INTERRUPT_CORE1_SPI_MEM_REJECT_INTR_MAP_V << INTERRUPT_CORE1_SPI_MEM_REJECT_INTR_MAP_S)
#define INTERRUPT_CORE1_SPI_MEM_REJECT_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_SPI_MEM_REJECT_INTR_MAP_S  0

/* INTERRUPT_CORE1_DCACHE_PRELOAD_INT_MAP_REG register
 * dcache_prelaod interrupt configuration register
 */

#define INTERRUPT_CORE1_DCACHE_PRELOAD_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xf4)

