apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_interrupt_core1.h
/* INTERRUPT_CORE1_DCACHE_PRELOAD_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map dcache_prelaod interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_DCACHE_PRELOAD_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_DCACHE_PRELOAD_INT_MAP_M  (INTERRUPT_CORE1_DCACHE_PRELOAD_INT_MAP_V << INTERRUPT_CORE1_DCACHE_PRELOAD_INT_MAP_S)
#define INTERRUPT_CORE1_DCACHE_PRELOAD_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_DCACHE_PRELOAD_INT_MAP_S  0

/* INTERRUPT_CORE1_ICACHE_PRELOAD_INT_MAP_REG register
 * icache_preload interrupt configuration register
 */

#define INTERRUPT_CORE1_ICACHE_PRELOAD_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xf8)

/* INTERRUPT_CORE1_ICACHE_PRELOAD_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map icache_preload interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_ICACHE_PRELOAD_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_ICACHE_PRELOAD_INT_MAP_M  (INTERRUPT_CORE1_ICACHE_PRELOAD_INT_MAP_V << INTERRUPT_CORE1_ICACHE_PRELOAD_INT_MAP_S)
#define INTERRUPT_CORE1_ICACHE_PRELOAD_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_ICACHE_PRELOAD_INT_MAP_S  0

/* INTERRUPT_CORE1_DCACHE_SYNC_INT_MAP_REG register
 * dcache_sync interrupt configuration register
 */

#define INTERRUPT_CORE1_DCACHE_SYNC_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xfc)

/* INTERRUPT_CORE1_DCACHE_SYNC_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map dcache_sync interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_DCACHE_SYNC_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_DCACHE_SYNC_INT_MAP_M  (INTERRUPT_CORE1_DCACHE_SYNC_INT_MAP_V << INTERRUPT_CORE1_DCACHE_SYNC_INT_MAP_S)
#define INTERRUPT_CORE1_DCACHE_SYNC_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_DCACHE_SYNC_INT_MAP_S  0

/* INTERRUPT_CORE1_ICACHE_SYNC_INT_MAP_REG register
 * icache_sync interrupt configuration register
 */

#define INTERRUPT_CORE1_ICACHE_SYNC_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x100)

/* INTERRUPT_CORE1_ICACHE_SYNC_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map icache_sync interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_ICACHE_SYNC_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_ICACHE_SYNC_INT_MAP_M  (INTERRUPT_CORE1_ICACHE_SYNC_INT_MAP_V << INTERRUPT_CORE1_ICACHE_SYNC_INT_MAP_S)
#define INTERRUPT_CORE1_ICACHE_SYNC_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_ICACHE_SYNC_INT_MAP_S  0

/* INTERRUPT_CORE1_APB_ADC_INT_MAP_REG register
 * apb_adc interrupt configuration register
 */

#define INTERRUPT_CORE1_APB_ADC_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x104)

/* INTERRUPT_CORE1_APB_ADC_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map apb_adc interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_APB_ADC_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_APB_ADC_INT_MAP_M  (INTERRUPT_CORE1_APB_ADC_INT_MAP_V << INTERRUPT_CORE1_APB_ADC_INT_MAP_S)
#define INTERRUPT_CORE1_APB_ADC_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_APB_ADC_INT_MAP_S  0

/* INTERRUPT_CORE1_DMA_IN_CH0_INT_MAP_REG register
 * dma_in_ch0 interrupt configuration register
 */

#define INTERRUPT_CORE1_DMA_IN_CH0_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x108)

/* INTERRUPT_CORE1_DMA_IN_CH0_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map dma_in_ch0 interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_DMA_IN_CH0_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_DMA_IN_CH0_INT_MAP_M  (INTERRUPT_CORE1_DMA_IN_CH0_INT_MAP_V << INTERRUPT_CORE1_DMA_IN_CH0_INT_MAP_S)
#define INTERRUPT_CORE1_DMA_IN_CH0_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_DMA_IN_CH0_INT_MAP_S  0

/* INTERRUPT_CORE1_DMA_IN_CH1_INT_MAP_REG register
 * dma_in_ch1 interrupt configuration register
 */

#define INTERRUPT_CORE1_DMA_IN_CH1_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x10c)

/* INTERRUPT_CORE1_DMA_IN_CH1_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map dma_in_ch1 interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_DMA_IN_CH1_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_DMA_IN_CH1_INT_MAP_M  (INTERRUPT_CORE1_DMA_IN_CH1_INT_MAP_V << INTERRUPT_CORE1_DMA_IN_CH1_INT_MAP_S)
#define INTERRUPT_CORE1_DMA_IN_CH1_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_DMA_IN_CH1_INT_MAP_S  0

/* INTERRUPT_CORE1_DMA_IN_CH2_INT_MAP_REG register
 * dma_in_ch2 interrupt configuration register
 */

#define INTERRUPT_CORE1_DMA_IN_CH2_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x110)

/* INTERRUPT_CORE1_DMA_IN_CH2_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map dma_in_ch2 interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_DMA_IN_CH2_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_DMA_IN_CH2_INT_MAP_M  (INTERRUPT_CORE1_DMA_IN_CH2_INT_MAP_V << INTERRUPT_CORE1_DMA_IN_CH2_INT_MAP_S)
#define INTERRUPT_CORE1_DMA_IN_CH2_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_DMA_IN_CH2_INT_MAP_S  0

/* INTERRUPT_CORE1_DMA_IN_CH3_INT_MAP_REG register
 * dma_in_ch3 interrupt configuration register
 */

#define INTERRUPT_CORE1_DMA_IN_CH3_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x114)

/* INTERRUPT_CORE1_DMA_IN_CH3_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map dma_in_ch3 interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_DMA_IN_CH3_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_DMA_IN_CH3_INT_MAP_M  (INTERRUPT_CORE1_DMA_IN_CH3_INT_MAP_V << INTERRUPT_CORE1_DMA_IN_CH3_INT_MAP_S)
#define INTERRUPT_CORE1_DMA_IN_CH3_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_DMA_IN_CH3_INT_MAP_S  0

/* INTERRUPT_CORE1_DMA_IN_CH4_INT_MAP_REG register
 * dma_in_ch4 interrupt configuration register
 */

#define INTERRUPT_CORE1_DMA_IN_CH4_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x118)

/* INTERRUPT_CORE1_DMA_IN_CH4_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map dma_in_ch4 interrupt to one of core1's external
 * interrupt
 */

