apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_interrupt_core1.h
#define INTERRUPT_CORE1_DMA_IN_CH4_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_DMA_IN_CH4_INT_MAP_M  (INTERRUPT_CORE1_DMA_IN_CH4_INT_MAP_V << INTERRUPT_CORE1_DMA_IN_CH4_INT_MAP_S)
#define INTERRUPT_CORE1_DMA_IN_CH4_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_DMA_IN_CH4_INT_MAP_S  0

/* INTERRUPT_CORE1_DMA_OUT_CH0_INT_MAP_REG register
 * dma_out_ch0 interrupt configuration register
 */

#define INTERRUPT_CORE1_DMA_OUT_CH0_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x11c)

/* INTERRUPT_CORE1_DMA_OUT_CH0_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map dma_out_ch0 interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_DMA_OUT_CH0_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_DMA_OUT_CH0_INT_MAP_M  (INTERRUPT_CORE1_DMA_OUT_CH0_INT_MAP_V << INTERRUPT_CORE1_DMA_OUT_CH0_INT_MAP_S)
#define INTERRUPT_CORE1_DMA_OUT_CH0_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_DMA_OUT_CH0_INT_MAP_S  0

/* INTERRUPT_CORE1_DMA_OUT_CH1_INT_MAP_REG register
 * dma_out_ch1 interrupt configuration register
 */

#define INTERRUPT_CORE1_DMA_OUT_CH1_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x120)

/* INTERRUPT_CORE1_DMA_OUT_CH1_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map dma_out_ch1 interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_DMA_OUT_CH1_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_DMA_OUT_CH1_INT_MAP_M  (INTERRUPT_CORE1_DMA_OUT_CH1_INT_MAP_V << INTERRUPT_CORE1_DMA_OUT_CH1_INT_MAP_S)
#define INTERRUPT_CORE1_DMA_OUT_CH1_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_DMA_OUT_CH1_INT_MAP_S  0

/* INTERRUPT_CORE1_DMA_OUT_CH2_INT_MAP_REG register
 * dma_out_ch2 interrupt configuration register
 */

#define INTERRUPT_CORE1_DMA_OUT_CH2_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x124)

/* INTERRUPT_CORE1_DMA_OUT_CH2_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map dma_out_ch2 interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_DMA_OUT_CH2_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_DMA_OUT_CH2_INT_MAP_M  (INTERRUPT_CORE1_DMA_OUT_CH2_INT_MAP_V << INTERRUPT_CORE1_DMA_OUT_CH2_INT_MAP_S)
#define INTERRUPT_CORE1_DMA_OUT_CH2_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_DMA_OUT_CH2_INT_MAP_S  0

/* INTERRUPT_CORE1_DMA_OUT_CH3_INT_MAP_REG register
 * dma_out_ch3 interrupt configuration register
 */

#define INTERRUPT_CORE1_DMA_OUT_CH3_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x128)

/* INTERRUPT_CORE1_DMA_OUT_CH3_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map dma_out_ch3 interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_DMA_OUT_CH3_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_DMA_OUT_CH3_INT_MAP_M  (INTERRUPT_CORE1_DMA_OUT_CH3_INT_MAP_V << INTERRUPT_CORE1_DMA_OUT_CH3_INT_MAP_S)
#define INTERRUPT_CORE1_DMA_OUT_CH3_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_DMA_OUT_CH3_INT_MAP_S  0

/* INTERRUPT_CORE1_DMA_OUT_CH4_INT_MAP_REG register
 * dma_out_ch4 interrupt configuration register
 */

#define INTERRUPT_CORE1_DMA_OUT_CH4_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x12c)

/* INTERRUPT_CORE1_DMA_OUT_CH4_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map dma_out_ch4 interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_DMA_OUT_CH4_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_DMA_OUT_CH4_INT_MAP_M  (INTERRUPT_CORE1_DMA_OUT_CH4_INT_MAP_V << INTERRUPT_CORE1_DMA_OUT_CH4_INT_MAP_S)
#define INTERRUPT_CORE1_DMA_OUT_CH4_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_DMA_OUT_CH4_INT_MAP_S  0

/* INTERRUPT_CORE1_RSA_INT_MAP_REG register
 * rsa interrupt configuration register
 */

#define INTERRUPT_CORE1_RSA_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x130)

/* INTERRUPT_CORE1_RSA_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map rsa interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_RSA_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_RSA_INT_MAP_M  (INTERRUPT_CORE1_RSA_INT_MAP_V << INTERRUPT_CORE1_RSA_INT_MAP_S)
#define INTERRUPT_CORE1_RSA_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_RSA_INT_MAP_S  0

/* INTERRUPT_CORE1_AES_INT_MAP_REG register
 * aes interrupt configuration register
 */

#define INTERRUPT_CORE1_AES_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x134)

/* INTERRUPT_CORE1_AES_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map aes interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_AES_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_AES_INT_MAP_M  (INTERRUPT_CORE1_AES_INT_MAP_V << INTERRUPT_CORE1_AES_INT_MAP_S)
#define INTERRUPT_CORE1_AES_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_AES_INT_MAP_S  0

/* INTERRUPT_CORE1_SHA_INT_MAP_REG register
 * sha interrupt configuration register
 */

#define INTERRUPT_CORE1_SHA_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x138)

/* INTERRUPT_CORE1_SHA_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map sha interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_SHA_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_SHA_INT_MAP_M  (INTERRUPT_CORE1_SHA_INT_MAP_V << INTERRUPT_CORE1_SHA_INT_MAP_S)
#define INTERRUPT_CORE1_SHA_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_SHA_INT_MAP_S  0

/* INTERRUPT_CORE1_CPU_INTR_FROM_CPU_0_MAP_REG register
 * cpu_intr_from_cpu_0 interrupt configuration register
 */

#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_0_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x13c)

/* INTERRUPT_CORE1_CPU_INTR_FROM_CPU_0_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map cpu_intr_from_cpu_0 interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_0_MAP    0x0000001f
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_0_MAP_M  (INTERRUPT_CORE1_CPU_INTR_FROM_CPU_0_MAP_V << INTERRUPT_CORE1_CPU_INTR_FROM_CPU_0_MAP_S)
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_0_MAP_V  0x0000001f
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_0_MAP_S  0

/* INTERRUPT_CORE1_CPU_INTR_FROM_CPU_1_MAP_REG register
 * cpu_intr_from_cpu_1 interrupt configuration register
 */

#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_1_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x140)

/* INTERRUPT_CORE1_CPU_INTR_FROM_CPU_1_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map cpu_intr_from_cpu_1 interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_1_MAP    0x0000001f
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_1_MAP_M  (INTERRUPT_CORE1_CPU_INTR_FROM_CPU_1_MAP_V << INTERRUPT_CORE1_CPU_INTR_FROM_CPU_1_MAP_S)
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_1_MAP_V  0x0000001f
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_1_MAP_S  0

/* INTERRUPT_CORE1_CPU_INTR_FROM_CPU_2_MAP_REG register
 * cpu_intr_from_cpu_2 interrupt configuration register
 */

