apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_interrupt_core1.h
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_2_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x144)

/* INTERRUPT_CORE1_CPU_INTR_FROM_CPU_2_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map cpu_intr_from_cpu_2 interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_2_MAP    0x0000001f
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_2_MAP_M  (INTERRUPT_CORE1_CPU_INTR_FROM_CPU_2_MAP_V << INTERRUPT_CORE1_CPU_INTR_FROM_CPU_2_MAP_S)
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_2_MAP_V  0x0000001f
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_2_MAP_S  0

/* INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_MAP_REG register
 * cpu_intr_from_cpu_3 interrupt configuration register
 */

#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x148)

/* INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map cpu_intr_from_cpu_3 interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_MAP    0x0000001f
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_MAP_M  (INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_MAP_V << INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_MAP_S)
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_MAP_V  0x0000001f
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_MAP_S  0

/* INTERRUPT_CORE1_ASSIST_DEBUG_INTR_MAP_REG register
 * assist_debug interrupt configuration register
 */

#define INTERRUPT_CORE1_ASSIST_DEBUG_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x14c)

/* INTERRUPT_CORE1_ASSIST_DEBUG_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map assist_debug interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_ASSIST_DEBUG_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_ASSIST_DEBUG_INTR_MAP_M  (INTERRUPT_CORE1_ASSIST_DEBUG_INTR_MAP_V << INTERRUPT_CORE1_ASSIST_DEBUG_INTR_MAP_S)
#define INTERRUPT_CORE1_ASSIST_DEBUG_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_ASSIST_DEBUG_INTR_MAP_S  0

/* INTERRUPT_CORE1_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP_REG register
 * dma_pms_monitor_violatile interrupt configuration register
 */

#define INTERRUPT_CORE1_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x150)

/* INTERRUPT_CORE1_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP : R/W; bitpos:
 * [4:0]; default: 16;
 * this register used to map dma_pms_monitor_violatile interrupt to one of
 * core1's external interrupt
 */

#define INTERRUPT_CORE1_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP_M  (INTERRUPT_CORE1_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP_V << INTERRUPT_CORE1_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP_S)
#define INTERRUPT_CORE1_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP_S  0

/* INTERRUPT_CORE1_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_REG register
 * core0_IRam0_pms_monitor_violatile interrupt configuration register
 */

#define INTERRUPT_CORE1_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x154)

/* INTERRUPT_CORE1_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP : R/W; bitpos:
 * [4:0]; default: 16;
 * this register used to map core0_IRam0_pms_monitor_violatile interrupt to
 * one of core1's external interrupt
 */

#define INTERRUPT_CORE1_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_M  (INTERRUPT_CORE1_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_V << INTERRUPT_CORE1_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_S)
#define INTERRUPT_CORE1_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_S  0

/* INTERRUPT_CORE1_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_REG register
 * core0_DRam0_pms_monitor_violatile interrupt configuration register
 */

#define INTERRUPT_CORE1_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x158)

/* INTERRUPT_CORE1_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP : R/W; bitpos:
 * [4:0]; default: 16;
 * this register used to map core0_DRam0_pms_monitor_violatile interrupt to
 * one of core1's external interrupt
 */

#define INTERRUPT_CORE1_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_M  (INTERRUPT_CORE1_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_V << INTERRUPT_CORE1_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_S)
#define INTERRUPT_CORE1_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_S  0

/* INTERRUPT_CORE1_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_REG register
 * core0_PIF_pms_monitor_violatile interrupt configuration register
 */

#define INTERRUPT_CORE1_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x15c)

/* INTERRUPT_CORE1_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP : R/W; bitpos:
 * [4:0]; default: 16;
 * this register used to map core0_PIF_pms_monitor_violatile interrupt to
 * one of core1's external interrupt
 */

#define INTERRUPT_CORE1_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_M  (INTERRUPT_CORE1_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_V << INTERRUPT_CORE1_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_S)
#define INTERRUPT_CORE1_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_S  0

/* INTERRUPT_CORE1_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_REG register
 * core0_PIF_pms_monitor_violatile_size interrupt configuration register
 */

#define INTERRUPT_CORE1_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x160)

/* INTERRUPT_CORE1_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP : R/W;
 * bitpos: [4:0]; default: 16;
 * this register used to map core0_PIF_pms_monitor_violatile_size interrupt
 * to one of core1's external interrupt
 */

