apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_interrupt_core1.h
#define INTERRUPT_CORE1_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_M  (INTERRUPT_CORE1_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_V << INTERRUPT_CORE1_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_S)
#define INTERRUPT_CORE1_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_S  0

/* INTERRUPT_CORE1_CORE_1_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_REG register
 * core1_IRam0_pms_monitor_violatile interrupt configuration register
 */

#define INTERRUPT_CORE1_CORE_1_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x164)

/* INTERRUPT_CORE1_CORE_1_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP : R/W; bitpos:
 * [4:0]; default: 16;
 * this register used to map core1_IRam0_pms_monitor_violatile interrupt to
 * one of core1's external interrupt
 */

#define INTERRUPT_CORE1_CORE_1_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_CORE_1_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_M  (INTERRUPT_CORE1_CORE_1_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_V << INTERRUPT_CORE1_CORE_1_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_S)
#define INTERRUPT_CORE1_CORE_1_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_CORE_1_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_S  0

/* INTERRUPT_CORE1_CORE_1_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_REG register
 * core1_DRam0_pms_monitor_violatile interrupt configuration register
 */

#define INTERRUPT_CORE1_CORE_1_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x168)

/* INTERRUPT_CORE1_CORE_1_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP : R/W; bitpos:
 * [4:0]; default: 16;
 * this register used to map core1_DRam0_pms_monitor_violatile interrupt to
 * one of core1's external interrupt
 */

#define INTERRUPT_CORE1_CORE_1_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_CORE_1_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_M  (INTERRUPT_CORE1_CORE_1_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_V << INTERRUPT_CORE1_CORE_1_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_S)
#define INTERRUPT_CORE1_CORE_1_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_CORE_1_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_S  0

/* INTERRUPT_CORE1_CORE_1_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_REG register
 * core1_PIF_pms_monitor_violatile interrupt configuration register
 */

#define INTERRUPT_CORE1_CORE_1_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x16c)

/* INTERRUPT_CORE1_CORE_1_PIF_PMS_MONITOR_VIOLATE_INTR_MAP : R/W; bitpos:
 * [4:0]; default: 16;
 * this register used to map core1_PIF_pms_monitor_violatile interrupt to
 * one of core1's external interrupt
 */

#define INTERRUPT_CORE1_CORE_1_PIF_PMS_MONITOR_VIOLATE_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_CORE_1_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_M  (INTERRUPT_CORE1_CORE_1_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_V << INTERRUPT_CORE1_CORE_1_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_S)
#define INTERRUPT_CORE1_CORE_1_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_CORE_1_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_S  0

/* INTERRUPT_CORE1_CORE_1_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_REG register
 * core1_PIF_pms_monitor_violatile_size interrupt configuration register
 */

#define INTERRUPT_CORE1_CORE_1_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x170)

/* INTERRUPT_CORE1_CORE_1_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP : R/W;
 * bitpos: [4:0]; default: 16;
 * this register used to map core1_PIF_pms_monitor_violatile_size interrupt
 * to one of core1's external interrupt
 */

#define INTERRUPT_CORE1_CORE_1_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_CORE_1_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_M  (INTERRUPT_CORE1_CORE_1_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_V << INTERRUPT_CORE1_CORE_1_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_S)
#define INTERRUPT_CORE1_CORE_1_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_CORE_1_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_S  0

/* INTERRUPT_CORE1_BACKUP_PMS_VIOLATE_INTR_MAP_REG register
 * backup_pms_monitor_violatile interrupt configuration register
 */

#define INTERRUPT_CORE1_BACKUP_PMS_VIOLATE_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x174)

/* INTERRUPT_CORE1_BACKUP_PMS_VIOLATE_INTR_MAP : R/W; bitpos: [4:0];
 * default: 16;
 * this register used to map backup_pms_monitor_violatile interrupt to one
 * of core1's external interrupt
 */

#define INTERRUPT_CORE1_BACKUP_PMS_VIOLATE_INTR_MAP    0x0000001f
#define INTERRUPT_CORE1_BACKUP_PMS_VIOLATE_INTR_MAP_M  (INTERRUPT_CORE1_BACKUP_PMS_VIOLATE_INTR_MAP_V << INTERRUPT_CORE1_BACKUP_PMS_VIOLATE_INTR_MAP_S)
#define INTERRUPT_CORE1_BACKUP_PMS_VIOLATE_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE1_BACKUP_PMS_VIOLATE_INTR_MAP_S  0

/* INTERRUPT_CORE1_CACHE_CORE0_ACS_INT_MAP_REG register
 * cache_core0_acs interrupt configuration register
 */

#define INTERRUPT_CORE1_CACHE_CORE0_ACS_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x178)

/* INTERRUPT_CORE1_CACHE_CORE0_ACS_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map cache_core0_acs interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_CACHE_CORE0_ACS_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_CACHE_CORE0_ACS_INT_MAP_M  (INTERRUPT_CORE1_CACHE_CORE0_ACS_INT_MAP_V << INTERRUPT_CORE1_CACHE_CORE0_ACS_INT_MAP_S)
#define INTERRUPT_CORE1_CACHE_CORE0_ACS_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_CACHE_CORE0_ACS_INT_MAP_S  0

/* INTERRUPT_CORE1_CACHE_CORE1_ACS_INT_MAP_REG register
 * cache_core1_acs interrupt configuration register
 */

#define INTERRUPT_CORE1_CACHE_CORE1_ACS_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x17c)

/* INTERRUPT_CORE1_CACHE_CORE1_ACS_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map cache_core1_acs interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_CACHE_CORE1_ACS_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_CACHE_CORE1_ACS_INT_MAP_M  (INTERRUPT_CORE1_CACHE_CORE1_ACS_INT_MAP_V << INTERRUPT_CORE1_CACHE_CORE1_ACS_INT_MAP_S)
#define INTERRUPT_CORE1_CACHE_CORE1_ACS_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_CACHE_CORE1_ACS_INT_MAP_S  0

/* INTERRUPT_CORE1_USB_DEVICE_INT_MAP_REG register
 * usb_device interrupt configuration register
 */

#define INTERRUPT_CORE1_USB_DEVICE_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x180)

/* INTERRUPT_CORE1_USB_DEVICE_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map usb_device interrupt to one of core1's external
 * interrupt
 */

#define INTERRUPT_CORE1_USB_DEVICE_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_USB_DEVICE_INT_MAP_M  (INTERRUPT_CORE1_USB_DEVICE_INT_MAP_V << INTERRUPT_CORE1_USB_DEVICE_INT_MAP_S)
#define INTERRUPT_CORE1_USB_DEVICE_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_USB_DEVICE_INT_MAP_S  0

/* INTERRUPT_CORE1_PERI_BACKUP_INT_MAP_REG register
 * peri_backup interrupt configuration register
 */

#define INTERRUPT_CORE1_PERI_BACKUP_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x184)

/* INTERRUPT_CORE1_PERI_BACKUP_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map peri_backup interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_PERI_BACKUP_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_PERI_BACKUP_INT_MAP_M  (INTERRUPT_CORE1_PERI_BACKUP_INT_MAP_V << INTERRUPT_CORE1_PERI_BACKUP_INT_MAP_S)
#define INTERRUPT_CORE1_PERI_BACKUP_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_PERI_BACKUP_INT_MAP_S  0

