apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_interrupt_core1.h
/* INTERRUPT_CORE1_DMA_EXTMEM_REJECT_INT_MAP_REG register
 * dma_extmem_reject interrupt configuration register
 */

#define INTERRUPT_CORE1_DMA_EXTMEM_REJECT_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x188)

/* INTERRUPT_CORE1_DMA_EXTMEM_REJECT_INT_MAP : R/W; bitpos: [4:0]; default:
 * 16;
 * this register used to map dma_extmem_reject interrupt to one of core1's
 * external interrupt
 */

#define INTERRUPT_CORE1_DMA_EXTMEM_REJECT_INT_MAP    0x0000001f
#define INTERRUPT_CORE1_DMA_EXTMEM_REJECT_INT_MAP_M  (INTERRUPT_CORE1_DMA_EXTMEM_REJECT_INT_MAP_V << INTERRUPT_CORE1_DMA_EXTMEM_REJECT_INT_MAP_S)
#define INTERRUPT_CORE1_DMA_EXTMEM_REJECT_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE1_DMA_EXTMEM_REJECT_INT_MAP_S  0

/* INTERRUPT_CORE1_INTR_STATUS_0_REG register
 * interrupt status register
 */

#define INTERRUPT_CORE1_INTR_STATUS_0_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x18c)

/* INTERRUPT_CORE1_INTR_STATUS_0 : RO; bitpos: [31:0]; default: 0;
 * this register store the status of the first 32 interrupt source
 */

#define INTERRUPT_CORE1_INTR_STATUS_0    0xffffffff
#define INTERRUPT_CORE1_INTR_STATUS_0_M  (INTERRUPT_CORE1_INTR_STATUS_0_V << INTERRUPT_CORE1_INTR_STATUS_0_S)
#define INTERRUPT_CORE1_INTR_STATUS_0_V  0xffffffff
#define INTERRUPT_CORE1_INTR_STATUS_0_S  0

/* INTERRUPT_CORE1_INTR_STATUS_1_REG register
 * interrupt status register
 */

#define INTERRUPT_CORE1_INTR_STATUS_1_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x190)

/* INTERRUPT_CORE1_INTR_STATUS_1 : RO; bitpos: [31:0]; default: 0;
 * this register store the status of the first 32 interrupt source
 */

#define INTERRUPT_CORE1_INTR_STATUS_1    0xffffffff
#define INTERRUPT_CORE1_INTR_STATUS_1_M  (INTERRUPT_CORE1_INTR_STATUS_1_V << INTERRUPT_CORE1_INTR_STATUS_1_S)
#define INTERRUPT_CORE1_INTR_STATUS_1_V  0xffffffff
#define INTERRUPT_CORE1_INTR_STATUS_1_S  0

/* INTERRUPT_CORE1_INTR_STATUS_2_REG register
 * interrupt status register
 */

#define INTERRUPT_CORE1_INTR_STATUS_2_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x194)

/* INTERRUPT_CORE1_INTR_STATUS_2 : RO; bitpos: [31:0]; default: 0;
 * this register store the status of the first 32 interrupt source
 */

#define INTERRUPT_CORE1_INTR_STATUS_2    0xffffffff
#define INTERRUPT_CORE1_INTR_STATUS_2_M  (INTERRUPT_CORE1_INTR_STATUS_2_V << INTERRUPT_CORE1_INTR_STATUS_2_S)
#define INTERRUPT_CORE1_INTR_STATUS_2_V  0xffffffff
#define INTERRUPT_CORE1_INTR_STATUS_2_S  0

/* INTERRUPT_CORE1_INTR_STATUS_3_REG register
 * interrupt status register
 */

#define INTERRUPT_CORE1_INTR_STATUS_3_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x198)

/* INTERRUPT_CORE1_INTR_STATUS_3 : RO; bitpos: [31:0]; default: 0;
 * this register store the status of the first 32 interrupt source
 */

#define INTERRUPT_CORE1_INTR_STATUS_3    0xffffffff
#define INTERRUPT_CORE1_INTR_STATUS_3_M  (INTERRUPT_CORE1_INTR_STATUS_3_V << INTERRUPT_CORE1_INTR_STATUS_3_S)
#define INTERRUPT_CORE1_INTR_STATUS_3_V  0xffffffff
#define INTERRUPT_CORE1_INTR_STATUS_3_S  0

/* INTERRUPT_CORE1_CLOCK_GATE_REG register
 * clock gate register
 */

#define INTERRUPT_CORE1_CLOCK_GATE_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x19c)

/* INTERRUPT_CORE1_REG_CLK_EN : R/W; bitpos: [0]; default: 1;
 * this register used to control clock-gating interrupt martrix
 */

#define INTERRUPT_CORE1_REG_CLK_EN    (BIT(0))
#define INTERRUPT_CORE1_REG_CLK_EN_M  (INTERRUPT_CORE1_REG_CLK_EN_V << INTERRUPT_CORE1_REG_CLK_EN_S)
#define INTERRUPT_CORE1_REG_CLK_EN_V  0x00000001
#define INTERRUPT_CORE1_REG_CLK_EN_S  0

/* INTERRUPT_CORE1_DATE_REG register
 * version register
 */

#define INTERRUPT_CORE1_DATE_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x7fc)

/* INTERRUPT_CORE1_INTERRUPT_DATE : R/W; bitpos: [27:0]; default: 33628928;
 * version register
 */

#define INTERRUPT_CORE1_INTERRUPT_DATE    0x0fffffff
#define INTERRUPT_CORE1_INTERRUPT_DATE_M  (INTERRUPT_CORE1_INTERRUPT_DATE_V << INTERRUPT_CORE1_INTERRUPT_DATE_S)
#define INTERRUPT_CORE1_INTERRUPT_DATE_V  0x0fffffff
#define INTERRUPT_CORE1_INTERRUPT_DATE_S  0

#endif /* __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_INTERRUPT_CORE1_H */
